<?php

namespace Fauxify\Fauxify\Provider\Nep;

use Fauxify\Fauxify\Provider\ParentBank;

class Bank extends ParentBank{
    
    protected $classABanks = [
        "कृषि विकास बैंक",
        "नेपाल बैंक",
        "राष्ट्रिय बाणिज्य बैंक",
        "नागरिक बैंक अन्तर्राष्ट्रिय",
        "एभरेस्ट बैंक",
        "ग्लोबल आईएमई बैंक",
        "हिमालयन बैंक",
        "कुमारी बैंक",
        "लक्ष्मी सनराइज बैंक",
        "मच्छापुच्छ्रे बैंक",
        "नबिल बैंक",
        "नेपाल निवेश मेगा बैंक",
        "नेपाल एसबीआई बैंक",
        "एनआईसी एशिया बैंक",
        "एनएमबी बैंक",
        "प्रहबु बैंक",
        "प्राइम कमर्शियल बैंक",
        "सानिमा बैंक",
        "सिद्धार्थ बैंक",
        "स्टैण्डर्ड चार्टर्ड बैंक"
    ];

    protected $classBBanks = [
        "कर्पोरेट विकास बैंक",
        "एक्सेल विकास बैंक",
        "गरिमा बिकास बैंक",
        "हरियो विकास बैंक",
        "ज्योति बिकास बैंक",
        "कमना सेवा बिकास बैंक",
        "कर्णाली विकास बैंक",
        "लुम्बिनी बिकास बैंक",
        "महालक्ष्मी विकास बैंक",
        "मितेरी विकास बैंक",
        "मुक्तिनाथ बिकास बैंक",
        "नारायणी विकास बैंक",
        "सलापा बिकास बैंक",
        "सप्तकोशी विकास बैंक",
        "संग्रीला विकास बैंक",
        "शाइन रेसुङ्गा विकास बैंक",
        "सिन्धु बिकास बैंक"
    ];

    protected $classCBanks = [
        "बेस्ट फाइनान्स",
        "क्यापिटल मर्चेन्ट बैंकिंग एण्ड फाइनान्स",
        "केन्द्रीय वित्त",
        "गोरखाली वित्त",
        "गुडविल वित्त",
        "गुहेश्वरी मर्चेन्ट बैंकिंग एण्ड फाइनान्स",
        "आईसीएफसी फाइनान्स",
        "जानकी फाइनान्स",
        "मन्जुश्री फाइनान्स",
        "बहुउद्देश्यीय वित्त",
        "नेपाल वित्त",
        "नेपाल शेयर बाजार र वित्त",
        "पोखरा वित्त",
        "प्रगतिशील वित्त",
        "रिलायन्स वित्त",
        "समृद्धि वित्त कम्पनी",
        "श्री इन्भेस्टमेन्ट एण्ड फाइनान्स"
    ];
    
    

}