<?php

namespace Fauxify\Fauxify\Provider\Nep;

use Fauxify\Fauxify\Provider\ParentCity;

class City extends ParentCity{

    protected $city = [
        'काठमाडौं', 'पोखरा', 'बिराटनगर', 'बीरगञ्ज', 'धरान', 'भरतपुर', 'जनकपुर', 'हेटौडा', 'बुटवल', 'नेपालगन्ज', 'इटहरी', 'धनगढी', 'भक्तपुर', 'डिपायल', 'धनकुटा', 'गौर', 'गोरखा', 'इलाम', 'इनारुवा', 'जलेश्वर', 'लहान', 'ललितपुर', 'महेन्द्रनगर', 'नेपालगंज', 'राजबिराज', 'रामेछाप', 'साँखुवासभा', 'सिराहा', 'तानसेन', 'तिकापुर', 'तिलोत्तमा', 'तुल्सीपुर', 'वालिङ'
    ];    
    

}