<?php

namespace Fauxify\Fauxify\Provider\Nep;

use Fauxify\Fauxify\Provider\ParentPerson;

class Person extends ParentPerson
{
    protected $titleName = [
        'डा.', 'एर.', 'प्रो.'
    ];

    protected $titleNameMale = [
        'डा.', 'एर.', 'प्रो.', 'श्री.',
    ];
    protected $titleNameFemale = [
        'डा.', 'एर.', 'प्रो.', 'श्रीमती.', 'सुश्री.',
    ];

    protected $maleFirstName = [
        'आदर्श', 'आदेश', 'आदित्य', 'आकाश', 'आनन्द', 'अबुद', 'अच्युत', 'अजय', 'अजित', 'अखिल', 'अक्षर', 'अक्षय', 'अमर', 'अमिर', 'अमित', 'अमोद', 'अमृत', 'अमूल्य', 'अनन्त', 'एन्जेल', 'अंगिकार', 'अनिल', 'अंकित', 'अंकुर', 'अनमोल', 'अंशु', 'अनुज', 'अर्जुन', 'अरुण', 'आशिष', 'आशोक', 'आशुतोष', 'अतल', 'अविनाश', 'आयुष',
        'बाबिश', 'बदल', 'बद्री', 'बैभव', 'भगवान', 'भक्ति', 'भानु', 'विवेक', 'बिक्री', 'विदुर', 'विद्वान', 'विकल', 'विकास', 'विकेश', 'विक्रम', 'विमल', 'विनम्र', 'विनय', 'विपिन', 'विप्लव', 'विपुल', 'विराज', 'विरेन्द्र', 'विशाल', 'विश्वास', 'विश्वान', 'बुद्ध',
        'चैतन्य', 'चन्दन', 'चन्द्र', 'चिराग',
        'दर्पण', 'दीप', 'दीपक', 'देव', 'धैर्य', 'धर्म', 'धर्मेन्द्र', 'धिरेन', 'दिवाकर', 'दिवस', 'एक्लाव्य',
        'गजेन्द्र', 'गौरव', 'गिरिश', 'गोकुल', 'गोपाल', 'गोविन्द', 'गृजा', 'ज्ञान', 'ज्ञानराज',
        'हंस', 'हार्दिक', 'हरि', 'हर्ष', 'हेमन्त', 'हिमाल', 'हितेश', 'हृदय',
        'ईश्वर',
        'जितेन्द्र', 'जीवन',
        'कविन्द्र', 'कैलास', 'कल्याण', 'कमल', 'कमोद', 'कपिल', 'करण', 'कर्ण', 'खगेन्द्र', 'किशोर', 'कृष', 'कृष्ण', 'कृसस', 'कुबेर',
        'लक्ष्मण', 'ललित', 'लव', 'लोचन', 'लोकेश',
        'माधव', 'मधुकर', 'मधुर', 'मंदीप', 'मनिश', 'मंजुल', 'मनोज', 'मिलन', 'मोहित', 'मृदुल',
        'नबिन', 'नकुल', 'नारायण', 'नरेन्द्र', 'नरेश', 'नील', 'नेरेन', 'निरजन', 'निर्मल', 'निरुपम', 'निश्चल', 'निशाद', 'निशान्त', 'न्यूटन',
        'ओम',
        'पारस', 'परिक्षित', 'परिमल', 'पवन', 'पियुष', 'प्रबल', 'प्रबेश', 'प्रभात', 'प्रबिन', 'प्रज्वल', 'प्रकाश', 'प्रमेश', 'प्रमोद', 'प्रणय', 'प्रनिल', 'प्रसन्न', 'प्रशान्त', 'प्रसुन', 'प्रताप', 'प्रतिक', 'प्रयाग', 'प्रियंशु', 'पृथ्वी', 'पूर्ण', 'पुष्कर',
        'राघव', 'राहुल', 'राजन', 'राजेश', 'राकेश', 'रमेश', 'रञ्जन', 'रणजीत', 'रिकी', 'रिजन', 'रिषब', 'रिषिकेश', 'रोहन', 'रोहित', 'रोशन',
        'सबिन', 'सचित', 'सफल', 'सागर', 'सहज', 'सहन', 'सजल', 'सकार', 'समीर', 'संचित', 'सन्देश', 'संजय', 'संजीव', 'संकल्प', 'सन्तोष', 'सरद', 'सरोज', 'सशी', 'सौम्य', 'सेवक', 'शैलेश', 'शक्ति', 'शमुन्द्र', 'शान्तनु', 'शशांक', 'शश्वत', 'शेखर', 'श्याम', 'सिद्धार्थ', 'सीताराम', 'सोहन', 'सोहिल', 'सोभित', 'सोविएत', 'स्पन्दन', 'सुबल', 'सुभम', 'सुबोध', 'सुदान', 'सुधीर', 'सुदीन', 'सुदिप', 'सुजन', 'सुजित', 'सुकान्त', 'सुमेल', 'सुनिल', 'सुरज', 'सुरेन्द्र', 'सूर्य', 'सुशान्त', 'सुशिल', 'सुयश', 'सुयोग', 'स्वागत', 'स्वप्निल', 'स्वरुप',
        'तेज', 'तिलक', 'तीर्थ', 'त्रैलोक्य', 'त्रिलोचन',
        'उदित', 'उज्ज्वल', 'उमेश', 'उत्तम',
        'योगेन्द्र', 'योगेश', 'युवराज',
    ];
    
    protected $femaleFirstName = [
        'आकाङ्क्षा', 'आञ्चल', 'आरति', 'आशिका', 'आयुषा', 'अलिषा', 'अम्बिका', 'अमृता', 'अनामिका', 'अनिता', 'अञ्जलि', 'अञ्जना', 'अञ्जेला', 'अन्जु', 'अंकिता', 'अनुप', 'अनु', 'अनुपा', 'अनुश्री', 'अनुस्का', 'आपेक्षा', 'अर्चना', 'अर्पिता', 'अरुणा', 'आशा',
        'बन्दिता', 'बर्षा', 'भवना', 'बिमला', 'बिना', 'बिन्दु', 'बिनिता', 'बिपना',
        'चाडानी', 'चमेली', 'चम्पा', 'चन्दना',
        'दामिनी', 'दीपा', 'दीप्ति', 'देपिका', 'दिव्या', 'दिक्षा', 'दिलमाया', 'दिप्शिका', 'दुर्गा',
        'गंगा', 'गरिमा', 'गौरी', 'गीता', 'गोमा', 'गृष्मा',
        'हर्षिका', 'हेमा', 'हिमानी',
        'ईशा', 'ईशिका', 'ईश्वरी',
        'जमुना', 'जानकी', 'जनुका', 'जिया', 'जुनु',
        'कविता', 'करुणा', 'कौशिका', 'खुशबू', 'कोमल', 'कोपिला', 'कृपा', 'कृति', 'कृतिका', 'क्षितिज', 'कुमुद', 'कुसुम',
        'ललिता', 'लता', 'लक्ष्मी', 'लिना', 'लुना',
        'माधवी', 'माधुरी', 'ममता', 'मनीला', 'मनिता', 'मन्जिता', 'मन्जु', 'माया', 'मायावती', 'मयुषी', 'मेनका', 'मेनुका', 'मिना', 'मीरा', 'मोतिवा', 'मुक्ति', 'मुना',
        'नविना', 'नम्रता', 'नन्दनी', 'नीलम', 'निरा', 'निर्मली', 'निशा', 'निशिता',
        'पल्लवी', 'पारिजात', 'पवित्रा', 'पिंकी', 'प्रभा', 'प्रविणा', 'प्रविता', 'प्रकृति', 'प्रमिला', 'प्राप्ति', 'प्रतिक्षा', 'प्रतिमा', 'प्रीति', 'प्रेक्ष्या', 'प्रेमना', 'प्रिया', 'प्रियंका', 'पूजा', 'पुनम', 'पूर्णिमा', 'पुष्पा',
        'रविना', 'राधा', 'राधिका', 'रक्षा', 'रमा', 'रमिता', 'रम्प्यारी', 'रानी', 'रञ्जना', 'रञ्जु', 'रश्मि', 'रेजिना', 'रेखा', 'रेणु', 'रेशमी', 'रिद्धि', 'रिना', 'रितु', 'रोशनी', 'रुपा',
        'सबिना', 'सबिता', 'सचेता', 'सचिता', 'साधना', 'सफला', 'सगिना', 'सहना', 'साजला', 'सक्षी', 'सकुन्तला', 'सलिपा', 'सम्झना', 'सम्पदा', 'समृद्धि', 'सन्ध्या', 'संगीता', 'सन्जना', 'संस्कृति', 'सन्तोषी', 'सरला', 'सरस्वती', 'सरिना', 'सरिता', 'सरमिला', 'सरुपा', 'सौभाग्या', 'शान्ति', 'शशिकला', 'शोवा', 'श्रद्धा', 'श्रेया', 'श्रीजा', 'शृष्टि', 'श्रिया', 'शुशिला', 'सिम्रन', 'सीता', 'स्मृति', 'स्नेहा', 'सोनी', 'सृजना', 'सुभेक्षा', 'सुजाता', 'सुजु', 'सुकृति', 'सुलोचना', 'सुमी', 'सुमन', 'सुमनिमा', 'सुनिला', 'सुरक्षा', 'सुस्मा', 'सुस्मिता', 'सुयेषा', 'स्वेच्छा',
        'तारा', 'तुलसी',
        'उमा', 'उर्वशी', 'उर्मिला', 'उषा',
        'वन्दना',
        'यमी', 'यशोधा', 'युष्मा',
    ];
    
    protected $lastName = [
        'आचार्य', 'अधिकारी', 'अगरवाल', 'अमात्य', 'अर्याल',
        'बैद्य', 'बज्राचार्य', 'बालामी', 'बानेपाली', 'बानिया', 'बञ्जादे', 'बराल', 'बस्नेत', 'बस्ताकोटी', 'बस्तोला', 'बस्याल', 'बेलबासे', 'भण्डारी', 'भट्ट', 'भट्टराई', 'भुसाल', 'विजुक्छे', 'विश', 'बोहरा', 'बुदाथोकी', 'ब्याञ्जनकार',
        'चालिसे', 'चाम्लिङ', 'चपागाइन', 'चौधरी', 'छेत्री',
        'दहाल', 'डाङोल', 'दवाडी', 'देवकोटा', 'धकाल', 'धामला', 'धौभादेल', 'धुंगेल',
        'गौचन', 'गौतम', 'घले', 'घिमिरे', 'गिरी', 'गोल्चा', 'गुरुङ', 'ज्ञाल्जेन', 'ज्ञावाली',
        'हमाल', 'हिमांशु', 'हुमगैं',
        'झा', 'जोशी',
        'कफ्ले', 'कन्देल', 'कञ्साकर', 'कार्की', 'कर्माचार्य', 'कर्ण', 'कट्वाल', 'कायस्थ', 'केसी', 'खड्का', 'खडगी', 'खान', 'खनाल', 'खरेल', 'खतिवडा', 'खत्री', 'खवास', 'कोइराला',
        'लामा', 'लामिछाने', 'लम्साल', 'लावटी', 'लिगल', 'लिम्बु', 'लोहनी',
        'मगर', 'महारजन', 'मैनाली', 'मलकर', 'मालेकु', 'मनन्धर', 'मार्हट्टा', 'मिश्र',
        'नकर्मी', 'नेगी', 'न्यौपाने',
        'पण्डित', 'पाराजुली', 'पालिक्का', 'पालेका', 'पाल्हुङ्गे', 'पुन', 'पुरी',
        'राई', 'रोका',
        'शाह', 'श्रेष्ठ', 'सिजापति', 'सुवेदी', 'सुव्वाल', 'सुशील', 'सुशिर', 'सुसेल',
        'तामाङ', 'तिवारी', 'तुलाधर', 'तुल्सानी', 'त्यागी',
        'थापा', 'दीपु', 'ठाकुर', 'ठामे', 'ठाकुरी', 'ठारू', 'थापा', 'थरू',
        'पन्त', 'पन्ती', 'पराजुली', 'पुडासैनी', 'पौडेल',
        'रिजाल', 'रिमाल', 'रेग्मी',
        'वाग्ले', 'वाच्पेङ्गे', 'विकारी', 'विक्रम', 'विष्ट', 'विश्वकर्मा', 'वैद्य', 'वैश्य', 'व्यास',
        'सँगे', 'सँग्राम', 'सक्सेना', 'सह', 'सापकोटा', 'सिंगदेवी', 'सिन्धुली', 'सुकुल', 'सुनुवार', 'सेन',
        'हंस', 'हामाल', 'हेटे',
    ];
    
    

}